threshold_list = {'旅遊': 0.6, '飲食': 0.6, '工作': 0.7, '節日': 0, '生日': 0, '金錢': 0.6, '交通': 0.6, '課業': 0.6, '氣象': 0.6, '政治': 0.55, '休閒娛樂': 0.6, '生活': 0.5, '年齡': 0.57}
extra_threshold_list = {'旅遊': 0, '飲食': 0, '工作': 0, '節日': 0.6, '生日': 0, '金錢': 0.65, '交通': 0.8, '課業': 0.65, '氣象': 0.8, '政治': 0.65, '休閒娛樂': 0, '生活': 0, '年齡': 0}
topic_keywords = {
    '旅遊': ['旅遊', '旅途', '景點', '觀光', '爬山', '順風', '出國', '風景', '旅行社', '旅店', '旅社', '旅客', '行李', '出發', '旅程'], 
    '飲食': ['吃', '喝', '甜點', '午餐', '中餐', '宵夜', '麵', '菜', '口味', '請客', '餐廳', '味道', '飲料', '料理', '廚師', '蛋糕', '下午茶', '餓', '湯', '水果', '外帶', '小吃', '飲食', '飲', '飲水', '飲酒', '肉', '食物', '煮', '聚餐'], 
    '工作': ['上班', '上班族', '工作', '薪資', '公司', '加班', '勞工', '出差', '忙', '公務', '早班', '行業', '打工', '實習', '企業'], 
    '節日': [], 
    '生日': [], 
    '金錢': ['錢', '破產', '財產', '買賣'], 
    '交通': ['鐵路', '交通', '公路', '火車', '開車', '捷運', '車票', '車站', '車禍', '飛機', '高鐵站'], 
    '課業': ['上課', '上學', '大學', '考試', '分數', '用功', '念書', '課業'], 
    '氣象': ['天氣', '氣候', '晴天', '下雨', '颱風', '烏雲', '雨天', '地震', '冷', '熱', '氣象'], 
    '政治': ['民意', '民調'], 
    '休閒娛樂': ['娛樂', '逛街', '攝影', '畫畫', '遊戲', '球', '小說', '電腦', '漫畫', '休閒', '上映', '上網', '上線', '聊天', '手機', '音樂', '表演', '故事', '電影', '設備', '好看', '收藏', '流行', '約', '手牌'], 
    '生活': ['生活', '一輩子', '衣服', '唱歌', '玩樂', '車', '拍照', '家', '見面', '聊天', '頭髮', '身體', '逛街', '早上', '假日', '睡', '大學', '健康', '心情', '地方', '地址', '地點', '有空', '事情', '買', '房', '小孩', '文化', '參加'], 
    '年齡': ['年輕', '年紀', '成熟', '老人', '青春']
}

use_to_find_keywords = {
    '旅遊': [], 
    '飲食': ['吃', '食', '飯', '酒', '煮'], 
    '工作': [], 
    '節日': ['節'], 
    '生日': [], 
    '金錢': ['錢'], 
    '交通': ['駕駛'], 
    '課業': ['課', '年級'], 
    '氣象': ['雨'], 
    '政治': ['黨', '政'], 
    '休閒娛樂': ['歌', '玩'], 
    '生活': [], 
    '年齡': []
}

more_keywords = {
    '旅遊': ['出遊', '自由行', '行程', '旅行', '出遠門'], 
    '飲食': [], 
    '工作': ['上早班', '上晚班', '上夜班', '下午班', '老闆', '事業', '上工', '同事', '上司', '上班族', '上下班', '下班'], 
    '節日': [], 
    '生日': ['生日', '生日快樂', '慶生'], 
    '金錢': [], 
    '交通': [], 
    '課業': [], 
    '氣象': [], 
    '政治': [], 
    '休閒娛樂': [], 
    '生活': ['住戶', '住家', '住宿', '住'], 
    '年齡': []
}

remove_keywords = {
    '旅遊': [], 
    '飲食': ['吃苦', '吃虧', '超吃虧', '吃不消', '口吃', '吃定', '好吃懶做', '通吃', '吃痴', '吃呆', '吃醋', '超吃醋', '吃味', '吃草', '吃痛', '省吃儉用', '坐吃山空', '吃驚', '吃緊', '偷吃步', '吃手', '爭風吃醋', '超白吃', '白吃', '大吃大睡'], 
    '工作': [], 
    '節日': ['細節', '脫節', '季節', '關節', '章節', '情節', '環節', '理節', '請節', '小節', '有節', '不拘小節'], 
    '生日': [], 
    '金錢': [], 
    '交通': [], 
    '課業': ['課長', '課金'], 
    '氣象': [], 
    '政治': ['郵政', '行政', '家政', '政大'], 
    '休閒娛樂': [], 
    '生活': [], 
    '年齡': []
}

append_keywords = {
    '旅遊': [], 
    '飲食': ['小吃店', '酒', '口福', '胃口', '請客'], 
    '工作': [], 
    '節日': ['新年', '過年', '國慶日', '國慶', '聖誕', '節日', '節日快樂', '兒童節', '中秋'], 
    '生日': [], 
    '金錢': ['窮', '元'], 
    '交通': [], 
    '課業': ['唸書', '作業'], 
    '氣象': ['打雷', '好天氣', '天空', '太陽'], 
    '政治': [], 
    '休閒娛樂': [], 
    '生活': [], 
    '年齡': []
}